app/controllers/api/v1/users_controller.rb

    def find_user
      @user = User.find_by_id!(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]